Revit 2024 API
BuiltInFailures.DimensionFailures.SpotDimensionFloatingPointError Property
 Some spot dimensions contain invalid floating-point values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpotDimensionFloatingPointError { get; }
Visual Basic
Public Shared ReadOnly Property SpotDimensionFloatingPointError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpotDimensionFloatingPointError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace